
# Генератор словаря

d = {
    'Мария': 133,
    'sdfsdf': 155
}
new = {a:d[a] for a in d}
print(d, new)

#
# lst = [1, 2, 3]
# lst2 = [10, 20, 30]
# q = {a:b for a in lst for b in lst2}
# print(q)

w = {1: 1, 2: 2, 3: 3, 3: 5}
w.update({2: 7, 10: 10})
print(w)


students = [
    ["Николай", "Никлоаев", 19],
    ["Виктор", "Викторов", 20],
    ["Иван", "Иванов", 21],
    ["Владимир", "Жириновский", 33],
    ["Константин", "Хабенский", 28],
    ["Ольга", "Петрова", 18],
    ["Светлана", "Пархоменко", 22],
    ["Екатерина", "Слуцкая", 25],
    ["Надежда", "Бабкина", 45],
    ["Ирина", "Иванова", 24]
]

ds = {a[0]: a[2] for a in students if a[2] > 15}
print(ds)